#!/usr/bin/env python3
# -*- coding: utf-8 -*-

"""
Вам дано число N и число X.
Выведите число X ровно N раз в формате [X, X, X,... ,X].
Используйте функцию print() для вывода списка.
"""

n = int(input())
x = int(input())
print([x] * n)


