#!/usr/bin/env python3
# -*- coding: utf-8 -*-

"""
Дана строка. Замените в этой строке все цифры 1 на слово 'one'.
"""

s = input()

s = s.replace("1", "one")

print(s)

