#!/usr/bin/env python3
# -*- coding: utf-8 -*-

"""
Напишите программу, которая будет считывать два целых числа
(каждое в отдельной строке) и выводить их сумму.
"""

a = input("a=")
b = input("b=")
sum = int(a) + int(b)
print("sum=", sum, sep='')


