#!/usr/bin/env python3
# -*- coding: utf-8 -*-

"""
Дана строка.
Получите новую строку, вставив между всеми парами
соседних символов исходной строки символ ∗.
"""

s = input()

print("*".join(s))


